Ran Plan for project: `Production` dir: `infra/terraform/environment/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.main.google_compute_backend_bucket.backend_bucket will be created
+ resource "google_compute_backend_bucket" "backend_bucket" {
      + bucket_name        = "spino-cup-2024-web-frontend-prod"
      + creation_timestamp = (known after apply)
      + enable_cdn         = true
      + id                 = (known after apply)
      + name               = "spino-backend-bucket-prod"
      + project            = "spino-cup-2024"
      + self_link          = (known after apply)

      + cdn_policy (known after apply)
    }

  # module.main.google_compute_global_address.web will be created
+ resource "google_compute_global_address" "web" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "spino-web-static-ip-prod"
      + prefix_length      = (known after apply)
      + project            = "spino-cup-2024"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # module.main.google_compute_global_forwarding_rule.forwarding_rule will be created
+ resource "google_compute_global_forwarding_rule" "forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "spino-forwarding-rule-prod"
      + network               = (known after apply)
      + port_range            = "443"
      + project               = "spino-cup-2024"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.main.google_compute_managed_ssl_certificate.web will be created
+ resource "google_compute_managed_ssl_certificate" "web" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "spino-web-cert-prod"
      + project                   = "spino-cup-2024"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "spino.kurichi.dev",
            ]
        }
    }

  # module.main.google_compute_target_https_proxy.https_proxy will be created
+ resource "google_compute_target_https_proxy" "https_proxy" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "spino-https-proxy-prod"
      + project            = "spino-cup-2024"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.main.google_compute_url_map.url_map will be created
+ resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "spino-url-map-prod"
      + project            = "spino-cup-2024"
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

  # module.main.google_dns_record_set.web will be created
+ resource "google_dns_record_set" "web" {
      + id           = (known after apply)
      + managed_zone = "spino-zone-prod"
      + name         = "spino.kurichi.dev."
      + project      = "spino-cup-2024"
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.main.google_storage_bucket.web will be created
+ resource "google_storage_bucket" "web" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "spino-cup-2024-web-frontend-prod"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "index.html"
        }
    }

  # module.main.google_storage_bucket_iam_member.public_access will be created
+ resource "google_storage_bucket_iam_member" "public_access" {
      + bucket = "spino-cup-2024-web-frontend-prod"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

  # module.main.local_file.kubeconfig will be created
+ resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "spino-kubeconfig-prod"
      + id                   = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p Production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=tosaken1116%252Fspino_cup_2024%252Finfra%252Fterraform%252Fenvironment%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p Production
  ```
Plan: 10 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```